hutscape/hutscape-arduino-boards/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Oak (Native USB Port)
# --------------------------------------
oak.name=Oak (Native USB Port)
oak.vid.0=0x2341
oak.pid.0=0x804d
oak.vid.1=0x2341
oak.pid.1=0x004d
oak.vid.2=0x2341
oak.pid.2=0x824d
oak.vid.3=0x2341
oak.pid.3=0x024d

oak.upload.tool=bossac
oak.upload.protocol=sam-ba
oak.upload.maximum_size=262144
oak.upload.maximum_data_size=32768
oak.upload.use_1200bps_touch=true
oak.upload.wait_for_upload_port=true
oak.upload.native_usb=true
oak.build.mcu=cortex-m0plus
oak.build.f_cpu=48000000L
oak.build.usb_product="Hutscape Oak"
oak.build.usb_manufacturer="Hutscape"
oak.build.board=OAK
oak.build.core=arduino
oak.build.extra_flags=-DCRYSTALLESS -D__SAMD21G18A__ {build.usb_flags}
oak.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
oak.build.openocdscript=openocd_scripts/arduino_zero.cfg
oak.build.variant=oak
oak.build.variant_system_lib=
oak.build.vid=0x2341
oak.build.pid=0x804d
oak.bootloader.tool=openocd
oak.bootloader.file=zero/samd21_sam_ba.bin
